# GetLeaderElbow Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..GetLeaderElbow Method
IndependentTag Class See Also
---
Returns the position of the elbow of the tag's leader that points to specified reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public XYZ GetLeaderElbow(
	Reference referenceTagged
)
```

Visual Basic
---
```text
Public Function GetLeaderElbow ( _
	referenceTagged As Reference _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetLeaderElbow(
	Reference^ referenceTagged
)
```

# ### Parameters
referenceTagged
    Type: Autodesk.Revit.DB..::..Reference The reference which is tagged.
# Remarks
Straight leaders do not have elbow points.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The specified reference does not have a leader or its leader is straight. -or- The specified reference is not currently tagged. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace